# ******************************************************************************************
# FileName     : Kit_NewEnergy_IoT.py
# Description  : 
# Author       : 박은정
# Created Date : 2024.08.29 : PEJ
# Reference    :
# Modified     : 2024.08.30 : PEJ : 메시지 key 변경
# ******************************************************************************************
board_firmware_verion = "newEnergy_0.92";


#===========================================================================================
# 기본 모듈 사용하기
#===========================================================================================
from machine import Pin
from ETboard.lib.pin_define import *                     # ETboard 핀 관련 모듈


#===========================================================================================
# IoT 프로그램 사용하기
#===========================================================================================
from ET_IoT_App import ET_IoT_App, setup, loop
app = ET_IoT_App()


#===========================================================================================
# OLED 표시 장치 사용하기
#===========================================================================================
from ETboard.lib.OLED_U8G2 import *
oled = oled_u8g2()


#===========================================================================================
# 전역 변수 선언
#===========================================================================================
solar_pin = ADC(Pin(A3))                                 # 태양광 발전 센서 핀: A3
wind_pin = ADC(Pin(A5))                                  # 풍력 발전 센서 핀: A5

solar_power = 0                                          # 태양광 발전 전압
wind_power = 0                                           # 풍력 발전 전압

solar_max = 0                                            # 태양광 발전 최댓값
wind_max = 0                                             # 풍력 발전 최댓값

c_value = 0.000806                                       # 전압 보정 값(3.3v / 4096)


#===========================================================================================
def et_setup():                                          #  사용자 맞춤형 설정
#===========================================================================================
    solar_pin.atten(ADC.ATTN_11DB)                       # 태양광 발전 센서 입력 모드 설정
    wind_pin.atten(ADC.ATTN_11DB)                        # 풍력 발전 센서 입력 모드 설정


#===========================================================================================
def et_loop():                                           # 사용자 반복 처리
#===========================================================================================
    do_sensing_process()                                 # 센싱 처리


#===========================================================================================
def do_sensing_process():                                # 센싱 처리
#===========================================================================================
    global solar_power, wind_power, solar_max, wind_max

    solar_value = solar_pin.read()                       # 태양광 발전량 측정값 저장
    solar_power = solar_value * c_value                  # 전압 보정
    if solar_power > solar_max:                          # 최댓값 저장
        solar_max = solar_power;

    wind_value = wind_pin.read()                         # 풍력 발전량 측정값 저장
    wind_power = wind_value * c_value                    # 전압 보정
    if wind_power > wind_max:                            # 최댓값 저장
        wind_max = wind_power;


#===========================================================================================
def et_short_periodic_process():                         # 사용자 주기적 처리 (예 : 1초마다)
#===========================================================================================    
    display_information()                                # 표시 처리


#===========================================================================================
def et_long_periodic_process():                          # 사용자 주기적 처리 (예 : 5초마다)
#===========================================================================================    
    send_message()                                       # 메시지 송신


#===========================================================================================
def display_information():                               # OLED 표시
#===========================================================================================
    global board_firmware_verion, solar_power, wind_power, solar_max, wind_max

    string_solar = "%0.2f" % solar_power                 # 태양광 발전 값을 문자열로 변환
    string_wind = "%0.2f" % wind_power                   # 풍력 발전 값을 문자열로 변환

    oled.clear()                                         # OLED 초기화
    oled.setLine(1, board_firmware_verion)               # 1번째 줄에 태양광
    oled.setLine(2, 'solar: ' + string_solar + 'v')      # 2번째 줄에 풍력
    oled.setLine(3, 'wind: '  + string_wind + 'v')       # 3번쩨 줄에 펌프 작동 상태
    oled.display()                                       # OLED에 표시


#===========================================================================================
def send_message():                                      # 메시지 송신
#===========================================================================================
    global solar_power, wind_power, solar_max, wind_max
    app.add_sensor_data("solar", solar_power);           # 센서 데이터 추가
    app.add_sensor_data("wind", wind_power);             # 센서 데이터 추가
    app.add_sensor_data("solar_max", solar_max);         # 센서 데이터 추가
    app.add_sensor_data("wind_max", wind_max);           # 센서 데이터 추가
    app.send_sensor_data();                              # 센서 데이터 송신


#===========================================================================================
# 시작 지점                     
#===========================================================================================
if __name__ == "__main__":
    setup(app, et_setup)
    while True:
        loop(app, et_loop, et_short_periodic_process, et_long_periodic_process)


#===========================================================================================
#                                                    
# (주)한국공학기술연구원 http://et.ketri.re.kr       
#
#===========================================================================================